
[
  {
    "title": "",
    "body": "",
    "description": "",
    "author": "",
    "tag": "",
    "release_date": "",
    "year": 0,
    "urls": {
      "github": "",
      "live": ""
    },
    "title_min": "",
    "cargo":"",
    "project_order": 0
  },
  {
    "title": "Web development from a minimalist point",
    "body": "Before we talk a little about technology, let's talk about a problem that many of us beginners have to face when starting out in the world of web development or general software development.\n\nOur work environment: We are talking about our computers, our code editors and all those tools that we have to use and review several times when we study or work. Let's divide this problem into different points, analyze them all and see how I solved these problems.\n\nYou will already know that the standard hardware kit is **Visual Studio Code** and **Google Chrome** when we talk about software development.\n\nIf you can use these tools without any problems, I recommend that you continue reading as we are going to discuss several topics with a minimalist ideology in mind, so if you want to implement this way of working, go ahead.\n\nOn the other hand, if you are unable to use these tools or it is difficult to do so due to a regular computer, then this article is for you. I want you to know that these tools that they recommend **(visual studio code and chrome)** are not the best, much less the only alternatives that exist. I recommend that you continue reading to learn and discover some of the best alternatives to be able to work or study software development in a minimal way, and this make this process more fluid and smooth.\n\nAs we progress through this article, I will tell you what I did and the steps I should follow to study and prepare as a software developer in a fluid and smooth way. I also say, personally, that I always have in mind the idea that I have to do the best I can, at least as possible. Always looking at how to do everything in a simpler, easier and more minimalist way. Without realizing it, I apply this ideology to all areas of my life, including my studies and work. And as a well-known German painter would say;\n\n> The skill of simplification is to eliminate the unnecessary in order to that the necessary can speak - Hans Hofmann\n\nIn this article we will not talk about study methods or roadMaps for learn this or that technology. This article is dedicated and intended those self-taught software development students who, as I a few years ago, are struggling to continue their studies with a slow computer, with an unresponsive code editor, or with code that doesn't copy. ... Making this point clear, let's continue.\n\n##### The notebook\n\nWhen I started studying web development (javascript and later html, and css) my computer was a lenovo with an Intel(R) CPU Celeron(R) N4020 @ 1.10GHz 1.10GHz, 4G ram and 64 bit. When it's time to buy it i had no idea about computers and well let's say that Although I didn't understand anything, this list of features seemed too much and for the price I paid I thought I was buying a super computer... i know, I know. Long story short, Visual Studio Code used to take about 20 minutes to open, and at this point, I don't had a single extension installed.\n\nBut after a while I realized something was up. Something was wrong with my computer, so I decided to turn my laptop exclusively in a tool for study, for web development Because I was focused on continuing my education so that I could finally dedicate myself to it (spoiler: it ends well) and That's where I really started working on it.\n\n##### Windows debugging\n\nThe first thing I did was format my laptop. After that, I took care of it to delete all programs that come by default in Windows, including The most basic ones like: the camera app, the gallery, the pic viewer, the microphone, the notes app, and many others small applications that, despite weighing a few MBs (some even KBs), I wanted to make sure there was nothing more than my tools for studying and working. There are small programs out there that are responsible for deleting all these apps with just one click, are not hard to find.\n\n> Productivity is never an accident. It is always the result of a Commitment to excellence, smart planning and effort focused. - Paul J. Meyer\n\nAfter leavng my windows completely clean, I went to the settings and advanced settings. I didn't have anything on my computer so I was´nt worried about messing nothing up. As I said at the beginning, I had decided that my laptop would be a tool totally geared towards the software development, both for studying and working.\n\nI took care of disabling everything that wasn't necessary or useless things. the one that still strained my computer a bit somehow, like: animations, transparent backgrounds, effects, and system transitions. Let's look at a few things I've disabled or uninstalled from my computer To give you an idea:\n\n![ windows ]( http://imgfz.com/i/e92oxSU.png )\n\n> These are the Windows appearance and performance settings. you You can get to them by pressing **the Windows** + **R** keys and typing **SystemPropertiesPerformance.exe** You can also do this by typing 'appearance settings' in the Windows search engine\n\n![ windows ]( https://imgfz.com/i/VCSKEif.png )\n\n> You can see these options by going to the accessibility settings and going into the visual effects section\n\n##### The terminal\n\nIf there's one thing you should know how to use when it comes to software development, it's the terminal.\n\nOne of the things that has always been criticized by Windows in development of software is the lack of a good terminal, although today there are ways to to improve that.\n\nThe first thing is to install [the Windows terminal](https://apps.microsoft.com/detail/9N0DX20HK701?hl=pt-br&gl=br). This terminal is developed by Microsoft and allows you to open **CMD**, **Powershell**, or **Azure shell**, among others. It's easily customizable with transparencies, background, colors and profiles.\n\nThe next thing would be to improve powershell. You can install a shell best like [OhMyPosh](https://ohmyposh.dev/), which allows you to have a similar to [zsh](https://www.zsh.org/) on Windows and is also easily customizable.\n\n![ windows ]( https://imgfz.com/i/HVPGBix.png )\n\nBut if in the end you don't like the powershell, you have the option to install the [Windows subsystem for linux](https://en.wikipedia.org/wiki/Windows_Subsystem_for_Linux). That's basically Linux inside Windows. This way you can have systems like Ubunto, Kali Linux or Debian and all its programs like bash itself interacting within your Linux system. It even allows you to run Linux GUIs inside Windows.\n\n##### Vim - first contact\n\nVim is a text editor, very famous because it is for terminal and because It has very powerful, though complex key combinations of learn. It comes as an evolution to another very similar editor, used on UNIX, called Vi.\n\nVim, although it has a graphic environment, where it is most used is directly from the terminal. For many (including me) this is a advantage because they can work from an SSH connection to a server remote. Another point of differentiation of Vim is that it is centered on the keyboard. While there are configs and plugins to make it work with the mouse, the fun is to use it with the keyboard because that way you save time.\n\n> And that's when I discovered touchTyping, but we can talk about that in another article\n\nAfter fully preparing my computer (after cleaning it up 'completely' and disable everything I don't need), I'm back on topic Principal, Web Development. So I started researching a lot about code editors and all related topics and something became clear for me... Visual Studio Code is completely deleted from the list.\n\nI had downloaded this editor initially because it was what everyone recommend, which I think is amusing, because I suppose people who The recommend think that everyone has a minimally good computer to running that program, and yes, at least in my case it worked... but Extremely slow, with a lot of lag... I couldn't write a line of code without any lag.\n\nBut of course, I think they ( The people who recommend Visual Studio Code ) think this editor is the best option because of the autocomplete, the large number of extensions it has to help newbies, or themes for customize and all that, but these points are not always the most Important.\n\n> In fact, I didn't care at all that the editor helped me programming autocomplete my code or that my editor was pretty\n\nThe first time I installed Vim on my terminal, I was completely lost (normal) already facing the editor you have to learn things and commands to be able to move minimally and scroll through the editor as the vim modes, keys, vim command line and of course... You've got to Learn how to get out of Vim (spoiler: you'll have to watch a tutorial) but actually installing vim is very easy.\n\nIf you're on Ubuntu/Debian, just run this in a terminal:\n\n```shell\nsudo apt install vim\n```\n\nIf you're on Fedora:\n\n```shell\nsudo dnf install vim\n```\n\nIf you're on Arch Linux:\n\n```shell\npacman -S vim\n```\n\nIf you prefer the snap version:\n\n```shell\nsudo snap isntall vim-editor --beta\n```\n\nOn Windows, if you're looking for the vim.exe, you can Find it on the [releases page](https://github.com/neovim/neovim/releases). Click on **Assets** and you will find the .zip file for Win64.\n\nLater you will realize that vim is not just pure software, but It has other versions that work more or less like distributions Linux, such as **UltraVim**, **SpaceVim**, **NeoVim** among Other. Later, if you're interested, you can try them out, No problem, as most of the things you learn at Vim will be useful for these other versions. I personally started using NeoVim directly and that's what I recommend to you, **NeoVim**.\n\nYou can also easily install it if you have the [Chocolatey](https://chocolatey.org/) package manager and Using this command on your temrinal.\n\n```shell\nchoco install neovim\n```\n\nOr with the [Scoop](https://scoop.sh/)\n\n```shell\nscoop install neovim\n```\n\nAnd that would lead us to another question... is there a difference between Vim and Nvim?.\n\n##### Vim vs Nvim - is there any difference?\n\nTo begin with, Vim is mainly developed by its creator, Although it is an open-source project and everyone can contribute, who decides and has control of the entire project is its creator. Neovim is a more recent project than Vim, is more community-oriented and would be That's it.\n\nWhat is the difference between Vi and Vim? Vim (Vi IMproved) is a Improved version of the Vi text editor, present on all systems UNIX.\n\n> In this blog we are not going to talk in depth about vim, its modes and commands, I just want you to have an idea so you can continue with the thread without Get lost\n\n##### Vim - global configuration\n\nOnce you have **installed vim** or **nvim**, you must configure it to work as a code editor for programming, as for now it's just a text editor (like a notepad, but on steroids) and by while it's like this...\n\n![alt](https://imgfz.com/i/azwHRGZ.png)\n\nWhen you start setting it up, you have two options, set it up using **VimScript** or **Lua**. Within the community there is a small dispute on this issue. about whether vimScript is better or lua is best. But here's the truth; Lua is more ergonomic for writing programs/plugins, but Vimscript is more ergonomic for interactive use (and maybe smaller configuration files).\n\nAnd here we are talking about comfort when setting up the vim or programming one plugin. vimScript is very repetitive and boring, and lua is more comfortable and... Fun to use... we could say. But the truth is, if you Not a vimmer, shouldn't worry too much about it, not yet, what What you need to worry about is that your vim works properly, so Let's take a look at some basic settings. You'll write these settings in a **.vimrc** file.\n\n```shell\n~/.vimrc\n```\n\nOr on the route\n\n```shell\n~/.config/nvim/init.vim\n```\n\ntalking about Vim, if you're on Windows you'd be on\n\n```shell\n`C:/Users/<YOUR_USER>/_vimrc`\n```\n\nOn Mac it should be here, although I'm not sure why I don't use Mac:\n\n```shell\n/usr/share/vim/vimrc\n```\n\nNow I'm going to tell you about some settings that I recommend for Start at VIM. then you can investigate on your own if you wish add more or remove some. Believe me, it's a huge world that you can explore to enrich your vim configuration.\n\n**VimScript**\n```vim\nsyntax on            \" Enable syntax highlighting \nset nu               \" Activate number row \nset tabstop=4        \" Show existing tab 4 spaces wide \nset softtabstop=4    \" Show existing tab 4 spaces wide \nset shiftwidth=4     \" When indenting with '>', and 4 spaces wide \nset expandtab        \" When pressing tab, enter 4 spaces \nset smarttab         \" insert tabs at the beginning of a line according to the offset width \nset smartindent      \" insert tabs at the beginning of a line according to the offset width \nset hidden           \" Hide the current buffer when a new file is opened \nset incsearch        \" incremental search \nset ignorecase       \" Ignore case in search \nset smartcase        \" Consider capitalization if there is a capital character \nset scrolloff=8      \" Minimum number of lines to keep above and below the cursor \nset colorcolumn=100  \" Draw a line on the given line to keep yourself aware of the line size \nset signcolumn=yes   \" Add a column to the left. Useful for lining \nset cmdheight=2      \" Give more space to display messages \nset updatetime=100   \" Time in milliseconds to consider changes \nset encoding=utf-8   \" Encoding must be utf-8 to enable fontk icons \nset nobackup         \" Do not backup files \nset nowritebackup    \" Do not backup files \nset splitright       \" Create the vertical divisions on the right \nset splitbelow       \" Create the vertical divisions on the right\nset autoread         \" Create the vertical divisions on the right \nset mouse=a          \" Enable mouse support \nfiletype on          \" Detect and set file type option and trigger FileType event \nfiletype plugin on   \" Upload the plugin file for the file type if any \nfiletype indent on   \" Upload the plugin file for the file type if any \n```\n\nWith these global settings, we're already preparing vim to be this development tool that we are looking for, so that it is more Comfortable to wear when programming. You might feel a little bit more comfortable with the vim now, but trust me, that's just the beginning. Now let's get to the plugins...\n\n##### Vim - plugins\n\nWhen talking about Plugins, we should look for tools to install them. In In my case I use junegunn's [Vim-Plug](https://github.com/junegunn/vim-plug), but there are also other similar tools such as [Packer.vim](https://github.com/wbthomason/packer.nvim).\n\n**Vim-Plug** is a plugin manager free, open-source, and minimalist that you can install or update plugins in parallel. Creates repository clones of each plugin separately to minimize disk space usage and download.\n\n![vim-plug](https://raw.githubusercontent.com/junegunn/i/master/vim-plug/installer.gif)\n\nI recommend that you go to the [Vim-Plug](https://github.com/junegunn/vim-plug) github repository to learn how it installs and better understand how to use and work with it. Having the vimplug, we can go to our config file and add that structure to it. It should look something like that thereby:\n\n```vim\ncall plug#begin()\n\n\" Seus plugins aqui\n\ncall plug#end()\n```\n\nAnd with this structure we can start installing plugins. Writing Something Like these three examples\n\n```vim\ncall plug#begin()\n\n\" The NERD tree will be loaded on the first invocation of the NERDTreeToggle command\nPlug 'preservim/nerdtree', { 'on': 'NERDTreeToggle' }\n\n\" Parentheses, square brackets, quotation marks, XML tags and more\nPlug 'tpope/vim-surround'\n\n\" Distraction-free writing in Vim.\nPlug 'junegunn/goyo.vim'\n\ncall plug#end()\n```\n\nAnd already having them in your list of plugins, you'll notice that there aren't yet alteration. This is because for VimPlug to work, we need to say to it to do so with some commands like:\n\n```vim\n:PlugInstall    \"Install Plugins\n:PlugUpdate     \"Install or update plugins\n:PlugClean      \"Remove unlisted plugins (bang version will be purged without warning)\n:PlugUpgrade    \"Update vim-plug itself\n:PlugStatus     \"Check Plugins Status\n:PlugDiff       \"Review changes from the previous update and pending changes\n```\n\nSo now, as I indicated above, we need to type **:PlugInstall** in the vim command line to Install our plugin lists. Let it charge, close the vim and open again or just type **:so %** and that's it. Our Plugins.\n\nAt this point, I got very excited and started installing all the plugins that I saw. trying this and that. I liked it very much. But at one point I had so many that my vim started to slow down and of course you know the that I did. Uninstall everything and start from scratch. Selecting Very Well This time what would be my list. I'd just put what really Needed.\n\n> Of course, making sure to delete all the rest of these plugins, following The ideology we've been talking about since the beginning of the blog\n\nRemember that in this article we are talking about how to do the best job being minimalist, using as little as possible, the most basic, the lightest, Which is not to say that it is a bad job, quite the opposite.\n\nIf you're already a developer, you know that the fewer lines and cleaner is your code, the better the performance, which means better at general. I like to bring this concept to every aspect of my life, it makes me feel better. And believe me, there's always a way more Easy and simple to get things done.\n\n> Perfection is attained, not when there is nothing left to add, but when there is nothing left to add. when there's nothing left to take away. - Antoine de Saint-Exupéry - aviator and French writer\n\n##### Min browser\n\nWe've already talked about a text editor to be able to work with this ideology. But now let's talk about a very minimal browser interesting that I personally useed to use on dayli basis.\n\nYou probably know some more famous browsers like **Google Chrome**, **Opera**,**Firefox**, **Microsoft Edge**, **Safari** among others, is understandable.\n\nLet's talk a little about Google Chrome, which is the leader in the ranking of Browsers. Today, it is used by more than 3,000 million users, specifically, by around 3,378,967,819 people at this day, which is equivalent to 64.91% of the Internet. That's awesome, possibly you're reading this blog from the Chrome. This is somewhat surprising, especially considering the magnitude of Google's ecosystem of apps and online services, including YouTube, Drive, Calendar, Docs, Maps, and Earth, among others.\n\nBut there's a problem. And I know Chrome has a lot of other problems, but I'm going to focus on just one of them, the one that mattered most to me at that moment, your High RAM consumption. If you can use Chrome without any problems, go but today I want to present you with a minimal alternative.\n\nI present to you [Min Browser](https://minbrowser.org/), a Browser focused on simplicity. Min is a fast and minimalist browser that protects your privacy. Includes an interface designed to minimize distractions and functions such as:\n\n- Full-text search of visited pages\n- Ad & Tracker Blocking\n- Auto-Reader Preview\n- Tasks (tab groups)\n- Password manager integration\n\nAmong several other functions. I recommend you check it out.\n\n![min browser](https://user-images.githubusercontent.com/10314059/53312382-67ca7d80-387a-11e9-9ccc-88ac592c9b1c.png)\n![min browser](https://camo.githubusercontent.com/e36d67ec82158d7fb4a10e2eb00ccacd58e057361d04b0a076677514afbde403/687474703a2f2f6d696e62726f777365722e6f72672f746f75722f696d672f7461736b732e706e67)\n![min browser](https://camo.githubusercontent.com/cfeca08dd8d13c3b196911e2abb020492d360c82c85c045bc94bedb7b83adbee/687474703a2f2f6d696e62726f777365722e6f72672f746f75722f696d672f7365617263686261725f6475636b6475636b676f5f616e73776572732e706e67)\n\n> Of course, the Min browser also has its drawbacks. as a vulnerability to cyberattacks (hacking). Vulnerability that Chrome minimizes with each update\n\n\n\nAnd that would be all, thanks for reading and I hope I helped.",
    "description": "In this blog we are going to talk about how or what tools I use when I work in software development with a minimalist ideology",
    "author": "Alan G. Alonso",
    "release_date": "Feb 26",
    "year": 2024
  },
  {
    "title": "Sonoro : Create and customize your own soundscape",
    "body": "If you're anything like me, whether studying or programming, you always like background noise. Sometimes we just want to listen to the rain, the sound of distant birds singing, the fire of a bonfire, or some lofi hip hop. and occasionally we want to hear particular noises, so we search for a video on YouTube about it; occasionally we find it, occasionally we don't.\n\nHere where **Sonoro** comes in.\n\n![Banner](https://github.com/touzand/sonoro/assets/91836977/aea97016-7f2d-4b14-ba16-1b396072b62c)\n\nSonoro is a **web application** built to serve as a companion for users who like to listen to sounds or videos in the background while they work, study or browse the Internet.\n\nIts operation is extremely simple. Just go to [Sonoro](https://sonoro.netlify.app/) and if you are on a computer, drag from one side to the other the bars that are under each icon and if you are on a smartphone, you just have to tab on the icon that you want to listen to, after tab on it a bar will appear at the bottom of your screen that you can drag from one side to the other to configure the sound.\n\nIn Sonoro you have a list with **more than 30 sounds**. from very relaxing to very stressful. Below you have a list with all the available sounds listed in order;\n\n| First phase | Second phase | Third phase\n |-----------------------|----------------------| ------|\n| Rain | Train-station | Construction\n| Thunder | Highway | Crime-scene\n| Coffe-shop | Office | Dungeon\n| Lofi-beats | Dentist | Fireworks\n| Waves | Playground | Beehive\n| Campfire | Casino | Alien-shop\n| Sbowl | Carnival | Volcano\n| Wind | Carnival | Zombies\n| River | Marching-band | Medieval-battle\n| Forest | Church-bells | Nuclear-siren\n| Birds | Lawnmower | --------\n| Crickets | Couple-arguing |--------\n| Frogs | Barn-animals |--------\n\nIf you are interested in knowing more about Sonoro, including **technical aspects**, I invite you to go to [Github](https://github.com/touzand/sonoro) where you can read more about the **development process** and **technologies used**.",
    "description": "Descripcion del segundo articulo",
    "author": "Alan G. Alonso",
    "tag": "Personal project",
    "release_date": "Feb 14",
    "year": 2024,
    "urls": {
      "github": "https://github.com/touzand/sonoro",
      "live": "https://sonoro-client.netlify.app/"
    },
    "title_min": "Sonoro",
    "cargo":"Full-stack Developer",
    "project_order": 5
  },
  {
    "title": "Min note : A quick and easy way to save your ideas",
    "body": "\nA simple and elegant note-taking app, designed for simplicity and ease of use.\n\nMin note give you the opportunity to save your notes or ideas quickly and easily. with the possibility of opening your account wherever you want, having access to your notes at any time and from any device, synchronizing every change you make instantly.\n\n![Banner](http://imgfz.com/i/Wxa32sl.png)\n\nIts operation and use is quite simple and intuitive. Let's do a little review of how to use Min note --\n\nWhen you register or enter your account using your email and password or directly accessing through your Google account, we will see an empty screen with a small message;\n\n![initial page](http://imgfz.com/i/gxDe1Zb.png)\n\nFrom here we can freely navigate the interface. Although for now, since we don't have any note, we can't do much. To fix that, let's create a note. and we will do it this way;\n\n![New](http://imgfz.com/i/hNfqIOg.png)\n\nBy clicking on the top button with the text \"new\" we will go directly to the section to write our note calmly.\n\n![New](http://imgfz.com/i/hTdjNBR.png)\n\nOnce we're done writing. we have two options; we can save it directly by clicking on this icon here;\n\n![Save](http://imgfz.com/i/0iAB1yS.png)\n\nOr we can click on the little gear on the left. By doing this we will get a small side panel where we can choose the background color we want for our note (at the same time automatically changing the font color so as not to have contrast problems) and we can also change the direction of the text of our note ( left, centralized or right).\n\n![Side menu](http://imgfz.com/i/vVsTcCy.png)\n\nOnce we have saved our note we will return to the main page where we can see our note in a minimized form. We will quickly see the title, the date on which we created it and its background color (this way we can maintain an organization depending on the background color of our notes).\n\n![home](http://imgfz.com/i/emso2dK.png)\n\nIn addition to this you can also do a couple of other things within Min note, but I'll let you discover them for yourself. If you are interested in knowing more about the development process or technical aspects, I recommend you go to [Github](https://github.com/touzand/min-note) where you can learn more about the technologies used during the development of Min notes and news about new updates.",
    "description": "A quick and easy way to save your ideas in a simple and minimalist web application",
    "author": "Alan G. Alonso",
    "tag": "Personal project",
    "release_date": "Jan 17",
    "year": 2024,
    "urls": {
      "github": "https://github.com/touzand/min-note",
      "live": "https://minnote-client.netlify.app/"
    },
    "title_min": "Min note",
    "cargo":"Front-end Developer",
    "project_order": 4
  },
  {
    "title": "Min eye-dropper : straight forward and user-friendly color picker",
    "body": "MCP is a straight forward and user-friendly Chrome extension color picker that allows you to get a color by selecting the HEX code of any pixel on a webpage and even outside the browser.\n\nIn other words, if your browser is not your only tool, you can freely choose the color of a pixel outside of your browser by activating the selector by clicking the \"select color from the web page\" button...\n\n![Min eye dropper banner](http://imgfz.com/i/g7hTxA3.png)\n\nDue to my needs, I had the notion to make this extension. I typically right-click a website's element to reveal the color, pick it up, and use it. I start looking for a tool to make it simple to achieve this. I discovered other programs that perform the same function, so a few weeks ago I decided \"i will make my own color picker\" a few weeks ago and the end product is shown here.\n\nIf you want to know more about technical aspects. I encourage you to visit [Github](https://github.com/touzand/eye-dropper) where you can read more about this tool.",
    "description": "( escribir descripcion )",
    "author": "Alan G. Alonso",
    "tag": "Personal project",
    "release_date": "Apr 28",
    "year": 2023,
    "urls": {
      "github": "https://github.com/touzand/eye-dropper",
      "live": "https://touzand.github.io/eye-dropper-client/"
    },
    "title_min": "Min eye-dropper",
    "cargo":"Full-stack Developer",
    "project_order": 3
  },
  {
    "title": "Upo : movie and series database",
    "body": "Upo is a huge database of information about films and series. where you can discover facts that you didn't know or also see the list of films that are ready to be released. Also see some information about them, information such as their launch date - on which platforms you can see them and how much orcament they produce.\n\n![Upo header](http://imgfz.com/i/1yVWaNS.png)\n\nMovies and series are listed giving the user easy access to explore between them. being divided into sections such as \"top movies\", \"top series and tv shows\", \"upcoming movies\" and more.\n\nIn addition, using a search bar you can do a quick and specific search, and find the movie or series you want in a few seconds.\n\n![Upo movie section](http://imgfz.com/i/Frq2KHe.png)\n\nSi te interesa saber mas sobre Upo, te invito a dirigirte al [Github](https://github.com/touzand/upo) en donde podras leer mas sobre los datos tecnicos y el proceso de desarollo",
    "description": "A huge database of information on films and series. where you can discover facts that you didn't know or also see the list of films that are ready to be released",
    "author": "Alan G. Alonso",
    "tag": "Personal project",
    "release_date": "Aug 6",
    "year": 2022,
    "urls": {
      "github": "https://github.com/touzand/upo",
      "live": "https://touzand.github.io/upo/"
    },
    "title_min": "Upo",
    "cargo":"Front-end Developer",
    "project_order": 2
  }
]
